# SQL playground

Notebook to play with advanced SQL queries. Topics include:
- String manipulation
- Case statements
- Variables
- Aggregate functions
- Windows
- Pivot tables
- Subqueries (correlated and non-correlated)
- Functions and stored procedures
- Profiling

## Load database

In [1]:
%%capture
%load_ext sql
%sql mysql://chinook:password@localhost/chinook

## String manipulation

For each employee, what is their department, username, and area_code?

In [33]:
%%sql

SELECT 
    CONCAT(first_name, ' ', last_name) AS name,
    SUBSTRING_index(email, '@', 1) AS username,
    CASE 
        WHEN LOCATE('Manager', title) THEN 'manager'
        ELSE LOWER(SUBSTRING_index(title, ' ', 1))
    END AS department,
    SUBSTR(phone, LOCATE('(', phone)+1, 3) AS area_code
FROM employee;

 * mysql://chinook:***@localhost/chinook
8 rows affected.

[('Andrew Adams', 'andrew', 'manager', '780'),
 ('Nancy Edwards', 'nancy', 'manager', '403'),
 ('Jane Peacock', 'jane', 'sales', '403'),
 ('Margaret Park', 'margaret', 'sales', '403'),
 ('Steve Johnson', 'steve', 'sales', '780'),
 ('Michael Mitchell', 'michael', 'manager', '403'),
 ('Robert King', 'robert', 'it', '403'),
 ('Laura Callahan', 'laura', 'it', '403')]

## Variables

Which albums have at least 20 rock tracks?

In [70]:
%%sql
SET 
    @min_tracks = 20, 
    @genre = 'Rock';

SELECT title, COUNT(*) AS min_tracks
FROM track t
LEFT JOIN genre g ON t.genre_id = g.genre_id 
LEFT JOIN album a ON t.album_id = a.album_id
WHERE g.name = @genre
GROUP BY title
HAVING min_tracks >= @min_tracks
ORDER BY title;

 * mysql://chinook:***@localhost/chinook
0 rows affected.
5 rows affected.

[('Chronicle, Vol. 1', 20),
 ('Chronicle, Vol. 2', 20),
 ('Greatest Hits', 30),
 ('Greatest Kiss', 20),
 ('My Generation - The Very Best Of The Who', 20)]

## Aggregate functions

Which countries have the largest number of sales and what is the number of tracks sold per sale?

In [55]:
%%sql

SELECT 
    billing_country AS country, 
    COUNT(total) AS sales,
    ROUND(AVG(il.number_of_tracks), 2) AS mean_tracks_per_sale,
    ROUND(STDDEV_SAMP(il.number_of_tracks), 2) AS tracks_per_sale_std
FROM invoice i
LEFT JOIN (
    SELECT 
        invoice_id, 
        SUM(quantity) AS number_of_tracks
    FROM invoice_line
    GROUP BY invoice_id
) il ON i.invoice_id = il.invoice_id
GROUP BY billing_country
ORDER BY sales DESC
LIMIT 10;

 * mysql://chinook:***@localhost/chinook
10 rows affected.

[('USA', 131, Decimal('8.02'), 4.0),
 ('Canada', 76, Decimal('7.12'), 4.75),
 ('Brazil', 61, Decimal('7.08'), 4.16),
 ('France', 50, Decimal('7.86'), 4.34),
 ('Germany', 41, Decimal('8.24'), 4.15),
 ('Czech Republic', 30, Decimal('9.20'), 4.83),
 ('Portugal', 29, Decimal('6.45'), 4.5),
 ('United Kingdom', 28, Decimal('8.86'), 3.48),
 ('India', 21, Decimal('8.81'), 3.72),
 ('Chile', 13, Decimal('7.54'), 3.91)]

## Windows

What is the cumulative sum of sales for each quarter of each year, and what is the percentage of yearly sales that happened each quarter?

In [49]:
%%sql

WITH quarterly_sales AS (
    SELECT 
        YEAR(invoice_date) AS year, 
        QUARTER(invoice_date) AS quarter, 
        ROUND(SUM(total)) AS sales
    FROM invoice
    GROUP BY YEAR(invoice_date), QUARTER(invoice_date)
)

SELECT 
    year,
    quarter,
    sales,
    ROUND(
        sales / SUM(sales) OVER (PARTITION BY year) * 100
    , 2) AS percentage_of_yearly_sales,
    SUM(sales) OVER (PARTITION BY year ORDER BY quarter) AS cumulative_quarterly_sales

FROM quarterly_sales;

 * mysql://chinook:***@localhost/chinook
16 rows affected.

[(2017, 1, Decimal('372'), Decimal('30.95'), Decimal('372')),
 (2017, 2, Decimal('323'), Decimal('26.87'), Decimal('695')),
 (2017, 3, Decimal('305'), Decimal('25.37'), Decimal('1000')),
 (2017, 4, Decimal('202'), Decimal('16.81'), Decimal('1202')),
 (2018, 1, Decimal('448'), Decimal('39.06'), Decimal('448')),
 (2018, 2, Decimal('232'), Decimal('20.23'), Decimal('680')),
 (2018, 3, Decimal('248'), Decimal('21.62'), Decimal('928')),
 (2018, 4, Decimal('219'), Decimal('19.09'), Decimal('1147')),
 (2019, 1, Decimal('270'), Decimal('22.09'), Decimal('270')),
 (2019, 2, Decimal('314'), Decimal('25.70'), Decimal('584')),
 (2019, 3, Decimal('411'), Decimal('33.63'), Decimal('995')),
 (2019, 4, Decimal('227'), Decimal('18.58'), Decimal('1222')),
 (2020, 1, Decimal('219'), Decimal('19.23'), Decimal('219')),
 (2020, 2, Decimal('323'), Decimal('28.36'), Decimal('542')),
 (2020, 3, Decimal('244'), Decimal('21.42'), Decimal('786')),
 (2020, 4, Decimal('353'), Decimal('30.99'), Decimal('1139'))]

## Pivoting rows to colums

How many sales have each employee made throughout each year?

In [105]:
%%sql

WITH employee_sales AS (
    SELECT 
        CONCAT(e.first_name, ' ', e.last_name) AS employee, 
        YEAR(i.invoice_date) AS year,
        COUNT(i.invoice_id) AS sales
    FROM invoice i
    LEFT JOIN customer c ON c.customer_id = i.customer_id
    LEFT JOIN employee e ON e.employee_id = c.support_rep_id
    GROUP BY CONCAT(e.first_name, ' ', e.last_name), YEAR(i.invoice_date)
)

SELECT 
    employee,
    SUM(CASE WHEN year = 2017 THEN sales ELSE NULL END) AS '2017',
    SUM(CASE WHEN year = 2018 THEN sales ELSE NULL END) AS '2018',
    SUM(CASE WHEN year = 2019 THEN sales ELSE NULL END) AS '2019',
    SUM(CASE WHEN year = 2020 THEN sales ELSE NULL END) AS '2020'
FROM employee_sales
GROUP BY employee;

 * mysql://chinook:***@localhost/chinook
3 rows affected.

[('Jane Peacock', Decimal('62'), Decimal('49'), Decimal('49'), Decimal('52')),
 ('Margaret Park', Decimal('56'), Decimal('53'), Decimal('54'), Decimal('51')),
 ('Steve Johnson', Decimal('36'), Decimal('49'), Decimal('56'), Decimal('47'))]

## Correlated subquires

A non-correlated subquery can be run as an independent query.

A correlated subquery cannot cannot be run independently. Correlated subqueries can usually be rewritten as a join query, which are more efficient to execute.

What tracks are the best sellers for USA and Canada?

In [177]:
%%sql

WITH track_quantities AS (
    SELECT 
        i.billing_country AS country,
        t.name AS track,
        SUM(il.quantity) AS quantity
    FROM invoice_line il
    LEFT JOIN track t on t.track_id = il.track_id
    LEFT JOIN invoice i on i.invoice_id = il.invoice_id
    GROUP BY i.billing_country, t.track_id, t.name
)

SELECT 
    a.country, a.track, a.quantity
FROM track_quantities a
WHERE a.quantity = (
    SELECT MAX(b.quantity)
    FROM track_quantities b
    WHERE a.country = b.country
)
AND a.country IN ('USA', 'Canada')
LIMIT 10

 * mysql://chinook:***@localhost/chinook
3 rows affected.

[('USA', 'War Pigs', Decimal('6')),
 ('Canada', 'Boris The Spider', Decimal('3')),
 ('Canada', 'Us And Them', Decimal('3'))]

## Functions

What street numbers are the most commonly used for billing addresses?

In [62]:
%%sql
SELECT billing_address
FROM invoice
LIMIT 100;

 * mysql://chinook:***@localhost/chinook
100 rows affected.

[('627 Broadway',),
 ('230 Elgin Street',),
 ('8, Rue Hanovre',),
 ('627 Broadway',),
 ('1033 N Park Ave',),
 ('194A Chain Lake Drive',),
 ('Ordynacka 10',),
 ('3,Raj Bhavan Road',),
 ('627 Broadway',),
 ('194A Chain Lake Drive',),
 ('Barbarossastraße 19',),
 ('9, Place Louis Barthou',),
 ('Rua dos Campeões Europeus de Viena, 4350',),
 ('319 N. Frances Street',),
 ('Porthaninkatu 9',),
 ('Av. Brigadeiro Faria Lima, 2170',),
 ('541 Del Medio Avenue',),
 ('162 E Superior Street',),
 ('Rua Dr. Falcão Filho, 155',),
 ('68, Rue Jouvence',),
 ('Sønder Boulevard 51',),
 ('Rua dos Campeões Europeus de Viena, 4350',),
 ('113 Lupus St',),
 ('Ullevålsveien 14',),
 ('4, Rue Milton',),
 ('421 Bourke Street',),
 ('Rua dos Campeões Europeus de Viena, 4350',),
 ('Praça Pio X, 119',),
 ('Erzsébet krt. 58.',),
 ('3 Chatham Street',),
 ('1498 rue Bélanger',),
 ('230 Elgin Street',),
 ('12,Community Centre',),
 ('5112 48 Street',),
 ('Rua da Assunção 53',),
 ('Celsiusg. 9',),
 ('3,Raj Bhavan Road',),
 ('Ordynacka 10',),
 ('4, Rue Milton',),
 ('Berger Straße 10',),
 ('C/ San Bernardo 85',),
 ('1 Infinite Loop',),
 ('120 S Orange Ave',),
 ('801 W 4th Street',),
 ('Tauentzienstraße 8',),
 ('Ullevålsveien 14',),
 ('Calle Lira, 198',),
 ('Porthaninkatu 9',),
 ('Rua Dr. Falcão Filho, 155',),
 ('627 Broadway',),
 ('1 Infinite Loop',),
 ('1 Infinite Loop',),
 ('68, Rue Jouvence',),
 ('2211 W Berry Street',),
 ('5112 48 Street',),
 ('Rua da Assunção 53',),
 ('1 Infinite Loop',),
 ('Sønder Boulevard 51',),
 ('Barbarossastraße 19',),
 ('700 W Pender Street',),
 ('3,Raj Bhavan Road',),
 ('Sønder Boulevard 51',),
 ('194A Chain Lake Drive',),
 ('202 Hoxton Street',),
 ('Via Degli Scipioni, 43',),
 ('1600 Amphitheatre Parkway',),
 ('4, Rue Milton',),
 ('Calle Lira, 198',),
 ('Theodor-Heuss-Straße 34',),
 ('194A Chain Lake Drive',),
 ('1498 rue Bélanger',),
 ('Via Degli Scipioni, 43',),
 ('Qe 7 Bloco G',),
 ('2211 W Berry Street',),
 ('1600 Amphitheatre Parkway',),
 ('8, Rue Hanovre',),
 ('Av. Brigadeiro Faria Lima, 2170',),
 ('Klanova 9/506',),
 ('Tauentzienstraße 8',),
 ('Qe 7 Bloco G',),
 ('Ullevålsveien 14',),
 ('12,Community Centre',),
 ('120 S Orange Ave',),
 ('Lijnbaansgracht 120bg',),
 ('5112 48 Street',),
 ('3 Chatham Street',),
 ('230 Elgin Street',),
 ('194A Chain Lake Drive',),
 ('801 W 4th Street',),
 ('421 Bourke Street',),
 ('Tauentzienstraße 8',),
 ('696 Osborne Street',),
 ('9, Place Louis Barthou',),
 ('Celsiusg. 9',),
 ('Erzsébet krt. 58.',),
 ('113 Lupus St',),
 ('Grétrystraat 63',),
 ('1 Microsoft Way',),
 ('421 Bourke Street',),
 ('12,Community Centre',)]

In [63]:
%%sql

DROP FUNCTION IF EXISTS extract_street_number;
CREATE FUNCTION extract_street_number (str VARCHAR(50)) 
RETURNS INT
NO SQL
BEGIN
    DECLARE street_number VARCHAR(50);
    
    # Set street number to 0 if missing.
    IF LENGTH(str) = 0 THEN
        RETURN '0';
    END IF;
    
    # Excract street number otherwise
    SET street_number = REGEXP_SUBSTR(str, '[0-9]+\w*');
    
    RETURN street_number;
END;

SELECT 
    extract_street_number(billing_address) AS street_number,
    COUNT(*) AS occurences
FROM invoice
GROUP BY extract_street_number(billing_address)
ORDER BY occurences DESC
LIMIT 100;

 * mysql://chinook:***@localhost/chinook
0 rows affected.
0 rows affected.
50 rows affected.

[(9, 50),
 (120, 22),
 (1, 21),
 (3, 21),
 (8, 20),
 (10, 20),
 (4, 18),
 (4350, 16),
 (7, 15),
 (198, 13),
 (2170, 13),
 (230, 13),
 (53, 13),
 (12, 13),
 (2211, 12),
 (3174, 12),
 (5112, 12),
 (541, 12),
 (155, 12),
 (68, 12),
 (85, 11),
 (34, 11),
 (194, 11),
 (801, 11),
 (119, 11),
 (113, 11),
 (69, 10),
 (58, 10),
 (2022, 10),
 (421, 10),
 (319, 10),
 (8210, 10),
 (302, 10),
 (51, 10),
 (11, 9),
 (14, 9),
 (1033, 9),
 (110, 9),
 (43, 9),
 (700, 9),
 (19, 9),
 (1498, 9),
 (1600, 8),
 (696, 8),
 (202, 8),
 (162, 8),
 (627, 8),
 (63, 7),
 (307, 5),
 (796, 4)]

## Todo

- Profiling (https://mode.com/sql-tutorial/sql-performance-tuning/?)
- Functions and stored procedures
- Other? (https://stackoverflow.com/questions/2054130/what-is-advanced-sql)

## Functions